benchmarks/results/auth-serialization/test-me/final/sar-metrics/wrk2/wrk_report.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/me
  2 threads and 4 connections
  Thread calibration: mean lat.: 2.603ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.599ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.60ms  675.90us   5.40ms   64.72%
    Req/Sec   315.79     69.04   444.00     56.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.54ms
 75.000%    3.07ms
 90.000%    3.56ms
 99.000%    4.22ms
 99.900%    4.66ms
 99.990%    5.23ms
 99.999%    5.41ms
100.000%    5.41ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.127     0.000000            1         1.00
       1.774     0.100000         1201         1.11
       1.975     0.200000         2403         1.25
       2.151     0.300000         3604         1.43
       2.349     0.400000         4809         1.67
       2.541     0.500000         6006         2.00
       2.647     0.550000         6606         2.22
       2.753     0.600000         7199         2.50
       2.853     0.650000         7799         2.86
       2.963     0.700000         8399         3.33
       3.069     0.750000         9002         4.00
       3.129     0.775000         9301         4.44
       3.211     0.800000         9597         5.00
       3.295     0.825000         9897         5.71
       3.375     0.850000        10195         6.67
       3.467     0.875000        10497         8.00
       3.509     0.887500        10645         8.89
       3.561     0.900000        10795        10.00
       3.615     0.912500        10944        11.43
       3.663     0.925000        11095        13.33
       3.721     0.937500        11247        16.00
       3.759     0.943750        11320        17.78
       3.795     0.950000        11396        20.00
       3.841     0.956250        11469        22.86
       3.885     0.962500        11545        26.67
       3.925     0.968750        11622        32.00
       3.953     0.971875        11656        35.56
       3.979     0.975000        11697        40.00
       4.019     0.978125        11733        45.71
       4.051     0.981250        11770        53.33
       4.089     0.984375        11806        64.00
       4.123     0.985938        11827        71.11
       4.159     0.987500        11844        80.00
       4.183     0.989062        11863        91.43
       4.231     0.990625        11882       106.67
       4.255     0.992188        11900       128.00
       4.279     0.992969        11909       142.22
       4.303     0.993750        11919       160.00
       4.319     0.994531        11929       182.86
       4.347     0.995313        11938       213.33
       4.383     0.996094        11948       256.00
       4.403     0.996484        11952       284.44
       4.427     0.996875        11956       320.00
       4.467     0.997266        11962       365.71
       4.491     0.997656        11965       426.67
       4.535     0.998047        11970       512.00
       4.551     0.998242        11972       568.89
       4.595     0.998437        11975       640.00
       4.603     0.998633        11977       731.43
       4.619     0.998828        11979       853.33
       4.663     0.999023        11982      1024.00
       4.671     0.999121        11983      1137.78
       4.679     0.999219        11984      1280.00
       4.707     0.999316        11985      1462.86
       4.795     0.999414        11986      1706.67
       4.835     0.999512        11988      2048.00
       4.835     0.999561        11988      2275.56
       4.895     0.999609        11989      2560.00
       4.895     0.999658        11989      2925.71
       4.911     0.999707        11990      3413.33
       4.943     0.999756        11991      4096.00
       4.943     0.999780        11991      4551.11
       4.943     0.999805        11991      5120.00
       4.943     0.999829        11991      5851.43
       5.231     0.999854        11992      6826.67
       5.231     0.999878        11992      8192.00
       5.231     0.999890        11992      9102.22
       5.231     0.999902        11992     10240.00
       5.231     0.999915        11992     11702.86
       5.407     0.999927        11993     13653.33
       5.407     1.000000        11993          inf
#[Mean    =        2.604, StdDeviation   =        0.676]
#[Max     =        5.404, Total count    =        11993]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18000 requests in 30.00s, 4.77MB read
Requests/sec:    599.98
Transfer/sec:    162.88KB